CHUANG522/stm32--/定时器定时中断--10/System/Timer.c
#include "stm32f10x.h"   // Device header

extern  uint16_t Num;



void Timer_Init(void)
{

    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);

    TIM_InternalClockConfig(TIM2);

    TIM_TimeBaseInitTypeDef  TIM_TimeBaseInitStructure;
    TIM_TimeBaseInitStructure.TIM_ClockDivision=TIM_CKD_DIV1;
    TIM_TimeBaseInitStructure.TIM_CounterMode=TIM_CounterMode_Up;
    TIM_TimeBaseInitStructure.TIM_Prescaler=7200-1;
    TIM_TimeBaseInitStructure.TIM_Period=10000-1;
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter=0;
    TIM_TimeBaseInit(TIM2,&TIM_TimeBaseInitStructure);

    TIM_ITConfig(TIM2,TIM_IT_Update,ENABLE);

    TIM_ClearFlag(TIM2, TIM_FLAG_Update);

    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

    NVIC_InitTypeDef  NVIC_Init_Struct;
    NVIC_Init_Struct.NVIC_IRQChannel=TIM2_IRQn;
    NVIC_Init_Struct.NVIC_IRQChannelCmd=ENABLE;
    NVIC_Init_Struct.NVIC_IRQChannelPreemptionPriority=0;
    NVIC_Init_Struct.NVIC_IRQChannelSubPriority=0;
    NVIC_Init(&NVIC_Init_Struct);
    TIM_Cmd(TIM2,ENABLE);
}
/*
void TIM2_IRQHandler(void)
{

    if (TIM_GetITStatus(TIM2,TIM_IT_Update == SET))
    {

        Num++;
        TIM_ClearITPendingBit(TIM2,TIM_IT_Update);
    }
}
*/













